#include <iostream> // Подключаем библиотеку iostream, которая позволяет использовать ввод и вывод данных.
#include <deque> // Подключаем библиотеку deque, которая позволяет использовать структуру данных "двусторонняя очередь".
using namespace std; // Используем пространство имен std, чтобы не писать std:: перед каждым вызовом функции из этого пространства имен.
 
int main() { // Начало основной функции программы.
   deque<int> first, second; // Объявляем две двусторонние очереди для хранения карт каждого игрока.
   for (int i = 0; i < 5; i++) { // Запускаем цикл от 0 до 5.
       int temp; // Объявляем временную переменную для хранения текущей карты.
       cin >> temp; // Считываем текущую карту из входных данных.
       first.push_back(temp); // Добавляем текущую карту в конец очереди первого игрока.
   }
   for (int i = 0; i < 5; i++) { // Запускаем еще один цикл от 0 до 5.
       int temp; // Объявляем временную переменную для хранения текущей карты.
       cin >> temp; // Считываем текущую карту из входных данных.
       second.push_back(temp); // Добавляем текущую карту в конец очереди второго игрока.
   }
 
   int count = 0; // Объявляем счетчик ходов и устанавливаем его равным 0.
   while (!first.empty() && !second.empty() && count < 1e6) { // Запускаем цикл, который продолжается, пока обе очереди не пусты и количество ходов меньше 1e6.
       int card1 = first.front(); // Берем верхнюю карту из очереди первого игрока.
       first.pop_front(); // Удаляем верхнюю карту из очереди первого игрока.
       int card2 = second.front(); // Берем верхнюю карту из очереди второго игрока.
       second.pop_front(); // Удаляем верхнюю карту из очереди второго игрока.
 
       if ((card1 == 0 && card2 == 9) || (card1 > card2 && card1 != 9 && card2 != 0)) { // Если карта первого игрока выигрывает...
           first.push_back(card1); // ...то добавляем обе карты в конец очереди первого игрока...
           first.push_back(card2); // ...(сначала карту первого игрока, затем карту второго игрока).
       } else { // Если карта второго игрока выигрывает...
           second.push_back(card1); // ...то добавляем обе карты в конец очереди второго игрока...
           second.push_back(card2); // ...(сначала карту первого игрока, затем карту второго игрока).
       }
       count++; // Увеличиваем счетчик ходов на 1.
   }
 
   if (count == 1e6) { // Если количество ходов достигло 1e6...
       cout << "botva"; // ...то выводим "botva".
   } else if (first.empty()) { // Если очередь первого игрока пуста...
       cout << "second " << count; // ...то выводим "second" и количество ходов.
   } else { // Если очередь второго игрока пуста...
       cout << "first " << count; // ...то выводим "first" и количество ходов.
   }
 
   return 0; // Завершаем функцию main и возвращаем 0, что означает успешное выполнение программы.
}
